abbrev
abbreviations
abc
abi
ability
ablation
able
abort
about
above
abs
absent
absolute
absolutize
absorb
absorbed
absorption
abstract
abstraction
abstractions
acc
acce
acceler
accelera
accelerate
accelerated
accelerator
accelerators
accep
accept
acceptance
accepted
accepts
access
accessed
accessible
accessing
accessor
accessors
accidental
accidentally
accor
according
accounting
accum
accumulat
accumulate
accumulated
accumulates
accumulation
accumulator
accumulators
accuracy
accurate
achieved
achievements
achieves
acknowledgement
acos
acquire
acr
acros
across
act
action
actionable
actions
activate
activates
activation
activations
active
actual
actuall
actually
ada
adafactor
adam
adamw
adaptation
adaptations
adapter
adapters
adaptive
add
added
addendum
adding
addition
additional
additions
additive
addoption
address
addressable
addressing
adds
adjacent
adjoint
adjoints
adjusted
adjustments
admitted
adoption
advance
advanced
advancement
advances
advancing
advantage
advantages
advertised
advertises
affine
affordances
after
again
against
agen
agent
agents
aggregate
aggregation
aggregator
agnostic
agpu
agree
agreement
agrees
ahead
ais
alert
alerting
alg
algeb
algebra
algebraic
algebras
algo
algorith
algorithm
algorithmic
algorithms
alias
aliased
aliases
alibi
align
aligned
alignmen
alignment
aligns
all
allclose
allgather
alloc
allocat
allocate
allocated
allocates
allocating
allocation
allocations
allocator
allocs
allow
allowed
allowlist
allowlisted
allows
allreduce
almost
alone
along
alongside
alpha
alphabetized
alphas
already
also
alternate
alternating
alternative
alwa
always
amax
ambient
amd
amdgcn
amdhsa
amdkfd
amg
amin
amortization
amortized
amp
ampere
ampersand
amx
anal
analysis
analytic
analytical
analyz
analyze
analyzer
anatomy
anchor
anchored
anchoring
anchors
and
angle
angles
annealed
annealing
annotate
annotated
annotates
annotation
annotations
annotator
anoth
another
ansi
answ
answer
answers
anthropic
anti
anticommutation
anticommutes
any
anyone
anything
anywhere
aot
api
apis
app
appear
appearing
appears
append
appended
appending
appendix
appends
appl
apple
appli
applicable
application
applications
applied
applies
apply
approach
approaches
appropriate
approx
approximate
approximately
approximation
apps
arange
arbitra
arbitrary
arch
arches
archi
architec
architect
architectural
architecture
architectures
archive
archived
are
area
areas
arg
argc
argmax
argmaxable
argmin
argnums
argparse
argpartition
argreduce
args
argsort
argtypes
argumen
argument
arguments
argv
arith
arithmetic
arity
arm
around
arr
array
arrays
arrive
artanh
artif
artifa
artifac
artifact
artifacts
ary
asarray
ascending
ascii
asin
ask
asked
asking
asm
assembled
assembly
assert
asserted
asserting
assertion
assertions
asserts
assessment
assets
assign
assigned
assignment
assignments
assigns
associative
assum
assume
assumes
assurance
ast
asymmetric
async
asynchronous
atan
atlas
atmospheric
atol
atom
atomic
atomicity
atomics
att
attach
attached
attaches
attempt
atten
attend
attends
attent
attenti
attention
attn
attr
attrib
attribu
attribut
attribute
attributes
attrs
aud
audi
audit
audited
auditing
aug
augassign
augment
augmentation
augmented
aut
author
authorable
authored
authoring
authoritative
authority
authors
auto
autocast
autodiff
autograd
autom
automated
automatic
automatically
automation
automorphism
automorphisms
autoregressive
autoregressively
autotun
autotune
autotuned
autotuner
autotuners
autotuning
ava
avai
availabl
available
average
averaged
averages
avg
avoid
avoidance
avoids
avx
await
aware
awareness
away
aws
axes
axioms
axis
azure
bac
back
backbone
backed
backend
backends
backgroun
background
backing
backlog
backoff
backprop
backpropagates
backs
backward
backwards
bad
bae
bake
balance
balanced
balancer
balances
balancing
balloon
ban
bandwi
bandwidth
bank
banks
bar
bare
barrier
barriers
base
based
baseline
baselines
bash
basic
basics
basis
batc
batch
batchable
batched
batcher
batches
batching
bay
bayes
bayesian
bearing
beats
becau
because
become
becomes
been
bef
befor
before
begin
beginner
beh
behav
behaves
behavior
behavioral
behaviors
behind
being
belongs
below
bench
benches
benchmark
benchmarked
benchmarking
benchmarks
benefit
benefits
bernoull
bernoulli
bert
best
bet
beta
betas
better
betw
between
beyond
bfloat
bfn
bfp
bias
bidirectional
big
bij
bijective
bik
bilevel
bilinear
bin
binaries
binary
bind
bindable
bindi
binding
bindings
binds
binned
binop
binops
bit
bite
bitmas
bitmask
bits
bitwise
bius
bivec
bivect
bivector
bivectors
bjk
blackhole
blackwell
blade
blades
blank
blanket
blas
blaschke
blessed
bloc
block
blocked
blocker
blockers
blockfp
blockify
blocking
blocks
blows
bmm
bmms
bnf
bnns
bodies
body
bogus
boltzmann
bonus
bool
boolean
booleans
boost
boot
bootstrap
bot
both
bottleneck
bottlenecks
bottom
boun
bound
boundaries
boundary
bounded
bounds
box
bpe
bpf
bps
bptt
bra
brace
braces
bracket
brackets
bradley
branch
branches
branching
branchwise
bre
breadcrumb
break
breakdown
breaks
bridge
bridges
bring
brings
broad
broadcast
broadcasting
broadcasts
broken
browser
brute
bsmm
bspline
bubble
bubbles
bucket
buckets
budget
buf
buffer
buffered
buffering
bufferization
buffers
bug
bugs
buil
build
buildable
builde
builder
builders
building
builds
built
builtin
bulk
bump
bumps
bundle
bundled
bundles
burn
bus
business
but
bwd
bypass
bypassed
bypasses
byte
bytes
cach
cache
cached
caches
caching
calculate
calculation
calculus
calibration
call
callable
callables
called
callee
caller
callers
calling
calls
can
cancel
cand
candidate
candidates
cannot
canon
canonica
canonical
canonicalizable
canonicalization
canonicalize
canonicalizer
canonicalizes
canonicals
cap
capabili
capabilit
capabilities
capability
capacit
capacity
capi
caps
capstone
capture
captured
captures
capturing
car
card
cares
carlo
carrie
carried
carries
carry
carrying
cartesian
cas
case
cases
casing
cast
casted
casting
casts
cat
cata
catal
catalog
catalogued
catalogues
catch
catches
categorical
categories
category
cauchy
caught
caus
causal
cause
caused
caveat
cayley
cblas
cbs
ccw
cdll
cdna
ceil
ceiling
cel
cell
cells
center
central
centralize
cerebras
cfg
cfm
cha
chai
chain
chained
chaining
chains
challenges
change
changed
changelog
changes
changing
channel
chaos
chapter
char
character
characteristics
characterization
characters
chart
charts
chat
chdir
che
cheap
cheaper
cheat
chec
check
checked
checker
checking
checklist
checklists
checkpoi
checkpoint
checkpointable
checkpointed
checkpointing
checkpoints
checks
checksum
checksums
child
children
chip
chips
choice
choices
chol
cholesky
choose
chooses
choosing
chosen
christoffel
chrome
chunk
chunked
chunking
chunks
churn
cin
circle
circles
circuit
circuits
circular
cispo
citation
cite
cites
citl
cla
claim
claimed
claiming
claims
clamp
clamps
clang
clarifies
clas
class
classes
classic
classical
classif
classification
classifications
classified
classifier
classifies
classify
classmethod
classmethods
claude
cle
clean
cleanly
cleanup
clear
cleared
clearing
clears
cli
clif
cliff
cliffor
clifford
climate
climbs
clip
clipped
clipping
clips
clock
clocks
clockwise
clone
closable
close
closeable
closed
closeout
closes
closing
closure
closures
cloud
clr
cls
cluster
clustered
cmake
cmd
cmp
cnn
coalesced
coalescing
coarse
coarser
cod
code
codebase
codeblocks
codegen
codes
codiff
codifferential
coding
coeff
coeffic
coeffici
coefficient
coefficients
coeffs
coefs
coerce
coerced
coerces
coercion
coexist
coexistence
coherent
coincident
col
cold
coll
collapse
collapses
collate
collec
collect
collecti
collection
collections
collectiv
collective
collectives
collector
collects
collide
collinear
collision
collisions
colmaj
cols
column
columns
com
comb
combination
combinators
combine
combined
combines
combining
come
comfort
comfortably
comm
comma
comman
command
commands
comme
comment
comments
commercial
commit
commits
committed
common
communication
community
commutative
comp
compa
compact
companion
comparable
comparator
compare
compares
comparing
comparison
comparisons
compat
compatibility
compatible
competitive
compil
compilation
compile
compileable
compiled
compiler
compilers
compiles
compiling
complaint
complet
complete
completed
completeness
completes
completion
completions
complex
complexity
compliance
compo
component
components
composability
composable
compose
composed
composes
composing
composite
composites
composition
compositional
compositions
compound
comprehensive
compress
compressed
compression
compu
comput
computation
computational
computations
compute
computed
computer
computes
computing
con
concat
concatenate
concentrat
concentrated
concentration
concentrations
concept
concepts
conceptual
concern
concerns
conclusion
concre
concrete
concretely
concurrency
concurrent
concyclic
concyclicity
cond
condensed
conditio
condition
conditional
conditionally
conditioned
conditioning
conduct
conf
confidence
confident
config
configs
configuration
configurations
configure
configured
confirm
confirmed
conflict
conflicts
conform
conformal
conformality
conformance
conformant
conftest
confuse
confusion
conj
conjugate
conjugation
connect
connecting
connection
consciously
consecu
consecutive
consequence
conservative
considerations
consist
consistency
consistent
consisting
console
consolidate
consolidated
const
constant
constants
constr
constrai
constrain
constrained
constraint
constraints
construc
construct
constructable
constructed
constructing
construction
constructions
constructor
constructs
consult
consults
consum
consume
consumed
consumer
consumers
consumes
consuming
consumption
cont
contai
contain
container
containerization
containers
containing
contains
contdiff
content
contention
contents
contested
context
contexts
contiguou
contiguous
continuation
continue
continuo
continuous
contour
contr
contra
contrac
contract
contracted
contraction
contracts
contradicts
contrastive
contribute
contributes
contributing
contribution
control
controlled
controls
conv
convenience
convention
conventions
conver
converge
convergent
converges
conversely
conversion
convert
converted
converter
converts
convolution
coo
cooley
cooperative
coord
coordinate
coordinates
coordination
coordinator
coords
copied
copies
copy
copying
cor
core
cores
corner
corr
corrdiff
corre
correct
correction
correctly
correctne
correctness
correlated
correlation
correspond
corresponding
corresponds
corrigenda
corrupt
corruption
cos
cosformer
cosh
cosine
cost
costs
cot
cotange
cotangent
cotangents
could
couldn
count
counted
counter
counterpart
counters
counts
coupling
cout
covariance
cove
cover
covera
coverag
coverage
coverages
covered
covering
covers
cpp
cpu
cpuid
cpx
cra
cracked
crafted
crash
crea
create
created
creates
creating
creation
creator
credit
criteria
criterion
critical
critique
crop
crops
cross
crosscuts
crosses
crossover
cryptic
crypto
csl
csr
csv
cta
ctc
ctest
ctir
ctr
ctx
ctypes
cube
cubic
cubin
cud
cuda
cumextrema
cummax
cummin
cumprod
cumsum
cumulate
cumulative
cupti
curated
curr
current
currently
cursor
curvature
curve
custo
custom
cut
cute
cutoff
cuts
cutting
cxx
cycles
cycli
cyclic
cyclical
daily
darwin
das
dashb
dashbo
dashboard
dashboards
dat
data
datacla
dataclass
dataclasses
dataflo
dataflow
dataloader
dataloaders
dataset
datasets
datatype
datatypes
date
day
days
dbar
dcmake
dct
ddim
ddof
ddp
ddpm
dead
deallocation
debt
debug
debugger
debugging
dec
decay
decided
decides
decisio
decision
decisions
decl
declar
declaration
declarations
declarative
declare
declared
declares
decls
deco
decod
decode
decoder
decodes
decoding
decompos
decompose
decomposed
decomposes
decomposi
decomposition
decor
decorat
decorate
decorated
decorates
decoration
decorator
decorators
decoupled
decrease
decreases
decreasing
decrement
decrements
dedented
dedicated
dedup
dedupe
deduped
dedupes
deduplicated
dedups
deep
deepcopy
deepscholar
deepseek
def
defau
defaul
default
defaults
defensive
defer
deferral
deferred
defers
deficient
define
defined
defines
defining
definite
definition
definitions
defs
deg
degenerate
degenerates
degrade
degrades
degree
del
delattr
delegates
deleted
deletion
deletions
deliberate
deliberately
delimiter
delitem
deliverable
deliverables
delivered
delta
deltanet
deltas
demand
demanding
demo
demonstrate
demonstrates
demonstration
demos
denoise
denoiser
denoising
denom
denominator
dense
dentropy
dep
depe
depen
depend
dependenc
dependencies
dependency
dependent
dependents
depends
deploy
deployment
deposit
deposits
deps
depth
depths
depthwise
dequant
dequantize
deri
deriv
derivation
derivative
derivatives
derive
derived
derives
deriving
des
desc
descent
describe
describes
describing
description
descriptor
descriptors
deserialization
deserializes
desi
desig
design
designed
dest
destination
destroy
destroyed
destroys
destructor
desugared
desugarer
desugaring
desugars
det
detached
detail
detailed
details
detect
detected
detection
detector
detects
determ
determin
determined
determines
determinism
deterministic
deterministically
dev
developer
developers
development
device
devices
devtensor
dft
dhariwal
dhwio
dia
diag
diagn
diagnost
diagnostic
diagnostics
diagonal
diagram
dialect
dialects
dict
dictionary
dicts
did
didn
diff
diffe
differ
differe
differen
difference
differences
different
differentiable
differential
differentiate
differentiation
differently
differing
differs
diffs
diffus
diffusio
diffusion
digamma
digest
digit
dilation
dilations
dim
dimens
dimensi
dimension
dimensional
dimensions
dims
din
dino
dinosaur
dinossl
dinov
dir
dire
direc
direct
directed
direction
directional
directions
directive
directl
directly
directories
directory
dirichlet
dirs
dis
disable
disabled
disables
disaggregated
disallowed
disallows
disclosure
discontinuous
discover
discoverable
discovers
discovery
discrete
discretized
discrimination
disjoint
disk
disp
dispat
dispatch
dispatche
dispatched
dispatcher
dispatchers
dispatches
dispatching
display
disposition
disqualifies
dist
distance
distill
distillation
distilled
distinct
distinguish
distinguishable
distinguishes
distribute
distributed
distributes
distribution
distributions
disturb
dit
div
dive
divergence
divergent
diverges
diverging
diverse
divi
divid
divide
divides
divisibility
divisible
division
divisor
dllm
dllvm
dma
dmlir
dnas
dnhwc
doc
docker
dockerfile
docs
docstring
docstrings
docum
documen
document
documentation
documented
documents
doe
does
doesn
doma
domain
domains
dominant
dominated
dominates
don
done
dont
door
dot
dotall
dotted
double
dout
down
downcasts
downgrade
download
downstrea
downstream
dpas
draf
draft
drain
dram
draw
drawn
draws
dri
drift
drifting
drive
driven
driver
drivers
drives
dro
drop
dropout
dropped
dropping
drops
dry
dsl
dst
dte
dtessera
dto
dty
dtype
dtypes
dual
dummy
dump
dumping
dumps
dup
duplicate
duplicates
duplication
dur
duration
during
dylib
dyna
dynamic
dynamics
eac
each
eager
earlier
early
easier
easy
eat
ebm
ebnf
ebt
ecc
echo
economic
ecosystem
edge
edges
edition
educational
eff
effect
effective
effects
efficiency
efficient
efficiently
effort
eight
einsum
either
elapsed
elastic
elasticity
elbo
elem
elemen
element
elements
elementwise
eleven
elf
eli
elif
eligible
eliminated
elimination
elision
elliptic
else
elsewhere
elu
ema
emb
embed
embedded
embeddin
embedding
embeddings
embeds
emerging
emi
emissi
emission
emit
emits
emitt
emitta
emittable
emitte
emitted
emitter
emitting
emp
empirical
empty
enable
enabled
enables
enabling
enc
enclosed
encloses
enclosing
enco
encode
encoded
encoder
encodes
encoding
encount
end
ending
endpoints
ends
ener
energ
energie
energies
energy
enforce
enforced
enforceme
enforcement
enforces
engine
engineer
engineering
engineers
enhanced
enhancement
enhancements
enou
enough
enqueue
enqueues
ens
ensemble
ensembles
ensure
ent
enter
enterprise
enters
entire
entirely
entities
entity
entries
entropy
entry
enum
enumerate
enumerates
enumeration
enums
env
envel
envelo
envelop
envelope
environmen
environment
envs
eos
epi
epilogue
epilogues
episode
epoch
epochs
eps
equal
equality
equals
equations
equator
equilibrium
equivalence
equivalent
equivariance
equivariant
erase
erf
erfc
ergonomic
ergonomics
err
erro
error
errors
esc
escape
essentials
established
estimate
estimated
estimates
estimator
estimators
eta
etc
euclidean
euler
eval
evals
evaluate
evaluated
evaluates
evaluating
evaluation
evaluator
eve
even
evenly
evenness
event
events
eventually
ever
every
everyday
everything
everywhere
evict
eviction
evictions
evicts
evidence
evolution
exa
exac
exact
exactly
examp
example
examples
exc
exce
exceed
exceeded
exceeding
exceeds
excellence
excellent
except
exception
exceptions
excessive
exchange
exchanges
exclude
excluded
excludes
exclusive
exe
exec
execut
executable
execute
executed
executes
executing
executio
execution
executions
executive
executor
executors
exercise
exercised
exercises
exercising
exhaustion
exhaustive
exist
existence
existent
existing
exists
exit
exp
expand
expanded
expands
expansion
expe
expect
expectation
expectations
expected
expects
expensive
exper
experience
experimental
experiments
expert
expertis
experts
explain
explained
explaining
explanation
expli
explic
explicit
explicitly
explode
explosion
expm
exponent
exponential
exponentially
expor
export
exportable
exported
exporter
exports
expos
expose
exposed
exposes
exposing
expr
express
expression
expressions
expressive
exprs
ext
extend
extended
extending
extends
extensibility
extension
extensions
extents
exterior
extern
external
extra
extrac
extract
extracted
extraction
extractor
extractors
extracts
extras
extremes
fabricate
facade
face
facing
fact
factor
factored
factories
factorization
factorized
factors
factory
facts
fail
failing
fails
failure
failures
faithful
fake
fal
fall
fallba
fallback
falls
fallthrough
false
falsy
fami
famil
familiar
families
family
fan
fanout
fans
faq
far
fas
fast
faster
fastest
fatal
fault
faults
favo
feasibility
feasible
featu
feature
featuremap
features
fee
feed
feedback
feeding
feeds
fence
fenced
fences
fetch
few
fewer
ffi
ffn
fft
fftvjp
field
fields
fifo
fifth
fig
file
filecheck
filename
files
filesys
filesystem
fill
filled
filling
fills
filter
filtered
filtering
filters
final
finalize
find
finding
findings
finds
fine
fingerprint
finish
finished
finit
finite
fir
fires
firing
firs
first
fit
fits
five
fix
fixed
fixes
fixing
fixt
fixture
fixtures
fixup
fla
flag
flagged
flagging
flags
flagship
flash
flashattn
flashmla
flat
flatten
flattened
flattens
flavor
flax
flexibility
flexible
flip
flips
flo
floa
float
floating
floats
floor
floors
flop
flops
flow
flowchart
flowmatch
flowrl
flows
fluent
fluid
flush
fmt
fnet
fns
fnv
focal
focused
fold
folded
folder
folders
folds
foll
follo
follow
followed
follows
followup
followups
foo
footprint
for
forbidden
force
forced
forces
forecast
forecasting
fori
forloop
form
formal
format
formats
formed
formerly
forming
forms
formula
formulation
forw
forwa
forwar
forward
forwarded
forwarding
forwards
found
foundation
foundational
four
fourier
fourth
fraction
fractions
frag
fragment
fram
frame
frames
framework
frameworks
framing
fre
free
freed
freeform
freely
frees
freeze
freezing
frequencies
frequency
frequently
fresh
freshly
freshness
friendly
friends
fro
frobeni
frobenius
from
front
frontend
frontends
frontier
frontmatter
frozen
frozenset
fryer
fsdp
fta
ful
full
fully
fun
func
funct
functi
functio
function
functional
functionally
functions
fundamental
fundamentals
further
fuse
fuseable
fused
fuses
fusion
fusions
futu
future
futures
fuz
fuzz
fwd
gae
gains
gamma
gammaln
gap
gaps
gat
gate
gateable
gated
gates
gath
gather
gathered
gathering
gating
gauge
gauss
gaussian
gbps
gcc
gcm
gcp
gddl
gdn
geglu
gel
gelu
gem
gemini
gemm
gemma
gemms
gemv
gen
gener
general
generalized
generally
generate
generated
generates
generating
generation
generations
generative
generator
generators
generic
generics
generous
genuinely
geo
geodesic
geome
geometric
geometry
geq
get
getattr
getitem
getke
getkernel
getrf
gets
getting
gflo
gfx
gguf
ghi
ghost
gibbs
gir
git
github
gitignore
giv
give
given
gives
glance
glass
glob
global
globs
glossary
glu
glue
glyph
glyphs
gmem
goal
goals
goes
golden
goldens
good
google
governed
gpipe
gpt
gpu
gpumlp
gpumsl
gqa
gra
grab
grace
graceful
gracefully
grad
grade
grades
gradie
gradient
gradients
grads
gradual
grafana
gram
grammar
graph
graphify
graphir
graphs
graphviz
great
greater
greedy
gregoryston
gregorystoner
grew
grid
gridded
griddepcontrol
grids
griffin
groovy
grou
ground
grounded
grounding
group
grouped
grouping
groups
grow
growing
grows
growth
grpo
gru
gspmd
gte
gua
guar
guaranteed
guarantees
guard
guarded
guards
guess
guessing
guidance
guide
guided
guidelines
guides
guiding
gum
gumbel
gumiho
gymnastics
had
haiku
half
halo
halos
halves
halving
hamiltonian
hand
handful
handl
handle
handled
handler
handles
handling
handoff
handrolled
hang
hangs
happens
happy
hard
hardcode
hardened
hardening
harder
hardware
harmonic
harness
has
hash
hashable
hashes
hasn
hasverifier
hat
hatch
hatches
hav
have
haven
having
hbm
hea
head
heade
header
headers
headings
headline
headliner
heads
health
healthz
heap
heavier
held
helios
helm
help
helper
helpers
helpful
hence
her
here
hessian
heuristic
heuristics
hex
hid
hidden
hiddens
hiding
hierarchical
hierarchies
hierarchy
high
higher
highest
highlights
hint
hints
hip
hipcc
historical
history
hit
hits
hkv
hlo
hmc
hmma
hodge
hoisted
hold
holding
holds
holomorphic
home
homebrew
honest
honestly
honesty
honored
honoring
honors
hoogeboom
hook
hooks
hop
hopper
horizontal
hos
host
hosted
hot
hotspot
how
hpp
hrm
hsaco
html
htmls
hto
http
hub
huber
hugging
huggingface
human
hung
husk
hvp
hwio
hyb
hybrid
hybrids
hydrostatic
hyena
hygiene
hyper
hyperband
hyperbolic
hyperparameters
hypothetical
hyv
idct
ide
idea
ideally
ideas
idempotency
idempotent
ident
identica
identical
identically
identifier
identifiers
identifies
identify
identities
identity
idle
ids
idx
ieee
iff
ifft
ignore
iii
ill
illegal
illustrative
ilp
ilu
imag
image
images
imaginary
img
imma
immed
immediate
immediately
immutable
impact
imperative
impl
implem
impleme
implemen
implement
implementa
implementation
implementations
implemented
implementing
implements
implications
implicit
implied
implies
impls
impor
import
importable
importance
important
imports
impossible
improved
improvement
improvements
improves
inc
incident
include
included
includes
including
inclusive
incoming
incompatible
inconsistency
inconsistent
increases
increment
incremental
incrementin
increments
ind
indent
independence
independent
index
indexable
indexed
indexes
indexing
indicating
indices
indiv
individual
individually
indivisible
indptr
inequality
inf
infer
inferable
infere
inference
inferred
infers
infinitely
infinitesimal
infinity
inflight
influence
info
information
informational
informative
informed
infrastructure
ingest
ingestion
inheritance
inherited
inherits
init
initial
initialise
initialization
initialize
initialized
initially
inject
injected
injection
injects
inline
inn
inner
innermost
innovation
innovations
inpu
input
inputs
ins
insensitive
insert
inserting
insertion
inserts
inside
insights
inspect
inspectable
inspected
inspecting
inspection
inspector
inspects
inspired
install
installation
installed
installs
instance
instances
instantiat
instantiate
instead
instr
instruct
instruction
instructions
instrumentation
int
intact
inte
integ
integer
integers
integral
integrand
integrate
integrated
integrates
integrating
integratio
integration
integrations
integrator
integrators
intel
intelligence
inten
intensity
intent
intentio
intentionall
intentionally
inter
interaction
interactive
interacts
intercepting
interception
interchangeable
interconnect
interest
interface
interfaces
interior
interleave
interleaved
interleaving
intermedia
intermediate
intermediates
internal
internally
interop
interoperability
interpo
interpolate
interpolation
interpret
interpretation
interpreter
intersection
interv
interval
into
intra
intrinsic
intrinsics
introduce
introduced
introduces
introduction
introspe
introspection
ints
intuitive
inv
invalid
invalidate
invariance
invariant
invariants
invent
inventories
inventory
inver
inverse
inversion
invert
inverts
invisible
invocation
invocations
invoke
invoked
invokes
involution
irectory
irfft
irop
irs
isa
isfinite
ish
isinf
isinstance
isn
isnan
iso
isolated
isolates
isolation
isometry
issue
issues
istft
item
items
iter
iterable
iterables
iterate
iterates
iteration
iterations
iterative
iterator
iters
its
itself
jacfwd
jacobi
jacobian
jacrev
jaw
jaws
jax
jenkins
jenkinsfile
jensen
jepa
jet
jetblock
jetnemotron
jit
jitfn
jitted
job
join
joins
joint
jso
json
jsonl
jupp
jupyter
just
jvp
jvps
kaiming
kan
kappa
kee
keep
keepdims
keeping
keeps
kept
ker
kern
kernel
kernels
key
keyed
keyerror
keys
keystone
keyword
keywords
kfd
kick
kicks
kimi
kind
kinds
kit
kittens
knee
knob
knobs
knots
know
knowing
knowledge
known
knows
kubernetes
kwa
kwar
kwarg
kwargs
kxe
label
labels
lacking
ladder
lamb
lambda
lan
land
landed
landing
landings
lands
lane
lanes
langevin
language
languages
laplacian
large
larger
largest
last
lat
late
latency
latent
latents
later
latest
latlon
lattice
lattices
lau
laun
launc
launch
launcher
launches
lay
laye
layer
layered
layernorm
layers
layou
layout
layouts
lazily
lazy
lcp
ldmatrix
lds
lea
leading
leaf
leak
leakage
leaked
leans
leapfrog
lear
learn
learnable
learned
learning
least
leave
leaves
left
leftover
leg
legacy
legal
legality
legalize
legend
legitimate
len
leng
lengt
length
lengths
less
lesson
lessons
let
lets
lev
leve
level
levels
lever
leviathan
lex
lexer
lexical
lexically
lgamma
lhs
lib
libraries
library
libs
libtessera
license
lie
life
lifecycle
lifetimes
lift
lifted
lifting
lifts
light
lightning
lightweight
like
likelihood
limit
limitations
limited
limiter
limits
lin
linalg
line
lineage
linear
linearly
lines
linformer
ling
link
linkable
linked
linker
linking
links
lint
linux
lion
list
listed
lists
lit
lite
liter
litera
literal
literals
literature
liv
live
lives
llama
llm
llvm
load
loadable
loade
loaded
loader
loadi
loading
loads
loc
loca
local
locate
locates
location
locations
lock
locked
locking
locks
log
logarithm
logger
logging
logic
logical
logically
logit
logits
logp
logprob
logprobs
logsoftmax
logsumexp
long
longcontext
longer
longest
loo
look
looking
looks
lookup
lookups
loop
loope
loops
loose
loosen
looser
lora
lorentz
losing
loss
losses
lossless
lotus
loud
low
lower
lowerable
lowercased
lowered
lowerer
lowering
lowers
lowest
lowpass
lrmult
lru
lse
lstm
lvalue
mac
mach
machine
machinery
macro
macros
made
mae
magn
magnitude
magnitudes
main
maintained
maintenance
major
make
makefile
maker
makes
making
mala
malformed
malloc
mamba
man
manage
managemen
management
manager
managers
manages
mandates
mani
manifest
manifested
manifests
manifold
manifolds
mantissa
manua
manual
manually
many
map
mapped
mapper
mapping
mappings
maps
march
mardia
margin
marginal
mark
markd
markdown
marked
marker
markers
marking
markov
marks
marsaglia
maruyama
mask
masked
masking
masks
mass
master
mat
matc
match
matched
matcher
matches
matchi
matching
material
materialization
materialize
materialized
materializes
math
mathematical
mathematically
matm
matmu
matmul
matmuls
matplotlib
matr
matrices
matrix
matters
max
maximal
maximum
may
maybe
mbarrier
mbarriers
mcmc
mdlm
mea
mean
meaningful
means
measur
measure
measured
measurement
measurements
measures
measuring
mechan
mechanism
mechanisms
median
mediated
medium
meet
meets
megalodon
megatron
mem
member
members
membership
memcpy
memo
memoization
memory
memref
memset
memspace
mental
mention
mentions
merge
merged
merging
mermaid
mes
mesh
meshes
message
messages
met
meta
metaclass
metadata
metal
metalium
metallib
meth
method
methodology
methods
metric
metrics
metropolis
mfm
mfma
mfu
mgrpo
mha
micro
microb
microbench
microbenches
mid
middle
midpoint
might
migrate
migrated
migrating
migration
migrations
migrator
milestone
milestones
milliseconds
mimics
min
mini
minimal
minimally
minimum
minkowski
minor
minus
mir
mirror
mirroring
mirrors
misa
misc
miscellaneous
mismatch
mismatched
mismatches
mismatching
miss
misses
missing
mistakes
misuse
mitigation
mittens
mix
mixed
mixer
mixing
mixture
mkdir
mla
mle
mlir
mlp
mlpackage
mlpkg
mlps
mma
mnemonic
mnemonics
mnist
mnk
mobile
mobius
mock
mod
modal
mode
model
modeling
models
moderate
modern
modes
modified
modifyitems
modul
modular
modulation
module
modules
modulus
moe
mojo
mome
moment
moments
momentum
monitor
monitoring
monolith
monotone
monotonic
monotonically
monte
month
months
moppo
mor
more
morl
morphism
most
mostly
motivates
motivatio
motivation
move
moved
movement
moves
moving
mpp
mps
mpsg
mpsgraph
mpspkgname
mqa
mse
msl
mtl
mtlpackage
mtlt
much
mul
mulhilo
muller
multi
multigrid
multilinear
multinomial
multip
multipath
multipl
multiple
multiples
multiplicati
multiplication
multiplicative
multiplied
multiplier
multipliers
multiplies
multiply
multiplying
multistep
multiv
multivector
multivectors
muon
murray
mus
must
mut
mutability
mutable
mutat
mutate
mutating
mutation
mutations
mutually
mvp
mxe
mxfp
mxp
mxu
mypy
naive
nam
name
named
namedtuple
names
namespace
namespaced
naming
nan
nano
nanoseconds
narr
narrow
narrower
nas
nat
nati
native
natively
natural
navigation
nbytes
nccl
nce
nchw
ncl
ncu
ndarray
ndhwc
ndim
near
nearby
nearest
nearly
necessary
need
needed
needham
needs
neg
negated
negates
negation
negative
neigh
neighbo
neighbor
neighbors
neither
nemot
nemotron
nest
nested
nesterov
nesting
nestings
net
network
networks
neumann
neural
neuralgcm
neutral
never
new
newbuffer
newest
newly
newton
next
nhwc
nic
nichol
nil
ninja
nll
nlohmann
nnz
node
nodes
nois
noise
noising
noisy
nominal
non
nondeterminism
nondeterminist
nondeterministic
nondiff
nondifferentiable
none
nonempty
nonexecutable
nonexistent
nonlinear
nonpositive
nonstandard
nonzero
noop
nope
nor
norm
normal
normalisation
normaliser
normaliz
normalizable
normalization
normalize
normalized
normalizes
normalizing
normally
normals
normative
norms
north
not
notable
note
notebook
noted
notes
nothing
noticed
now
nrhs
nsa
nsight
nth
ntk
nuance
nucleus
null
num
numa
number
numbers
numel
numer
numerator
numeri
numeric
numerical
numerically
numerics
numpy
nvcc
nvfp
nvgpu
nvi
nvid
nvidia
nvl
nvml
nvptx
nvrtc
nvtile
nvtma
nvtx
nvvm
nvwgmma
nxbf
nxe
nxf
obeys
object
objective
objectives
objects
obs
observability
observable
observations
observe
observed
observer
observes
occupancy
odd
ode
ods
off
offending
offers
offload
offs
offset
old
older
oldest
omega
omits
omitted
once
onchip
one
ones
oneshot
ongoing
onl
online
only
onnx
ons
onto
ontology
onwards
oob
oom
opaque
opbench
opco
opcode
open
opened
opening
opens
operan
operand
operands
operat
operate
operates
operating
operation
operational
operations
operator
operators
opinionated
opportunities
opportunity
opposite
ops
opt
optax
opti
optim
optimal
optimi
optimis
optimization
optimizations
optimize
optimized
optimizer
optimizers
optimizes
optimizing
optimum
option
optional
optionally
options
opts
optuna
oracle
orchestration
orchestrator
ord
order
ordered
ordering
orders
organises
organization
orientati
orientation
oriented
origin
original
orphan
orthogonal
orthogonalization
orthogonalize
orthogonalizes
orthonormal
oss
oth
othe
other
others
otherwi
otherwis
otherwise
our
out
outcome
outcomes
outer
outermost
outgoing
outlives
outp
outperform
outpu
output
outputs
outside
outstanding
outward
over
overall
overclaim
overflow
overhead
overlap
overlapped
overlapping
overr
overri
overrid
override
overrides
overrun
oversample
overshoot
overshoots
overview
overwrite
overwrites
overwriting
own
owned
owner
owners
owning
owns
pack
package
packaged
packages
packaging
packed
packing
packs
pad
padded
padding
pads
page
paged
pages
pai
pain
pair
paired
pairing
pairs
pairwise
pandas
paper
papers
par
para
paraboloid
paral
parallel
parallelism
parallelizable
parallelization
parallelize
param
parame
paramet
parameter
parameterization
parameterized
parameters
parametric
parametrize
parametrized
paramize
params
paren
parent
parents
pareto
parity
parse
parseable
parsed
parser
parsers
parses
part
partia
partial
partially
participates
participation
partition
partitioned
partitioner
partitioning
partitions
parts
party
pas
pass
passe
passed
passes
passing
passthrough
past
paste
pat
patch
path
paths
pattern
patterns
payloa
payload
payo
payoff
pcgrad
pcie
pct
pddl
pde
peak
peaks
peek
peel
peer
peft
penalties
penalty
pending
pentagon
per
percentile
percentiles
perf
perfect
perfetto
perform
performance
periodic
periodicity
perm
permissions
permutat
permutation
permutations
permute
perpendicular
perplexity
persist
persistence
persistent
persists
perturbations
pessimist
pest
pha
phantom
phantoms
phas
phase
phases
phasing
phi
philosophy
philox
phrase
phrases
physical
physically
physics
pick
picked
picki
picklable
pickle
picks
picture
piece
pieces
piecewise
pilot
pin
pinned
pinning
pins
pip
pipe
pipeline
pipelines
pipelining
pivot
pivoting
pjrt
pkg
pkgtype
pla
place
placeholder
placeholders
placeme
placement
places
plain
plan
plane
plannable
planne
planned
planner
planning
plans
platform
playbook
playbooks
plot
plug
pluggable
plugin
plumb
plumbing
plus
pmap
pmax
pmean
pmin
pmv
png
poc
poi
poin
poincar
poincare
point
pointcloud
pointer
pointers
pointing
points
pointwise
pointy
poison
poisson
pole
poles
policies
policy
poly
polyak
polygon
polymorphic
polymorphism
polynom
polynomi
polynomial
pool
pooler
pooling
pop
popped
pops
populate
populated
populates
population
port
portability
portabl
portable
porting
portion
pos
posi
posit
position
positional
positions
positive
positives
posix
possible
possibly
post
posterior
postlude
postnas
postpones
posture
potential
pow
power
ppl
ppo
practical
practice
practices
pre
preamble
prebuilt
precede
precedence
preceding
precis
precise
precisio
precision
precommit
precompil
precompile
precompute
precomputed
precond
preconditioner
preconditions
pred
predecessor
predecessors
predi
predicate
predicates
predict
predictability
prediction
predicts
preempt
preemption
prefe
prefer
prefers
prefetch
prefetching
prefill
prefix
prefixed
prefixes
prep
prepare
prepared
preprocess
prerequisite
prerequisites
prese
present
preserve
preserved
preserves
preserving
preset
presets
pressure
pretend
pretrained
pretty
prev
prevents
prevertex
prevertices
previo
previous
previously
pri
prim
primal
primals
primary
prime
primi
primitiv
primitive
primitives
prin
principal
principle
principles
print
printable
printed
prints
prior
prioritized
prioritizes
priority
privilege
privileged
privileges
pro
prob
probabilistic
probabilities
probability
probe
probes
probing
problem
problems
probs
proc
process
processes
processing
prod
produc
produce
produced
producer
producers
produces
produci
producing
product
production
productivity
products
prof
proficiency
profile
profiled
profiler
profiles
profiling
progr
progra
program
programmer
programmers
programming
programs
progress
progressive
proj
project
projected
projection
projections
projects
prologue
prometheus
promise
promised
promises
promote
promoted
promotes
promotion
promotions
promp
prompt
prompting
prompts
proo
proof
proofs
propagate
propagated
propagates
propagation
proper
properties
property
proposal
proposals
propose
proposed
proposes
proposition
props
protection
protocol
protocols
prototype
prototypes
prov
prove
proved
proven
provenance
proves
provi
provid
provide
provided
provider
provides
providing
proxy
prune
prunes
pruning
pseudo
pseudoscalar
psum
ptr
ptx
pub
publi
public
publication
publicly
puct
pull
pullback
pulled
pulls
punch
pure
purpose
push
pushes
pushforward
put
puts
putting
pybind
pynvml
pyplot
pyproject
pyt
pytes
pytest
pyth
pytho
python
pythonic
pythonpath
pytorch
pytree
pytrees
qint
qkv
qlora
qmc
qmcplan
qos
qparams
quadratic
qualification
qualified
qualifies
qualify
qualitative
quality
quant
quantification
quantised
quantitative
quantization
quantize
quantized
quantizers
quartic
quasi
que
queried
queries
query
queryable
question
questions
queue
queues
quick
quickstart
quiet
quote
qwen
race
rack
radial
radians
radius
radix
ragged
raii
raise
raised
raises
ram
ran
rand
randint
randn
random
randomly
rang
range
ranges
rank
ranked
ranks
rapid
rare
ratchet
rate
rates
rather
ratio
rational
rationale
raw
raws
ray
rays
rbm
rccl
rdna
rdzv
rea
reach
reacha
reachable
reaches
read
readable
reader
readers
readiness
reading
readme
reads
ready
real
realistic
reality
reallocate
rearrange
reas
reason
reasoner
reasoning
reasons
reassembles
reassessment
reauthor
rebind
rebinding
rebuild
rec
recap
recei
receive
received
receiver
receives
recent
recipe
recipes
reciprocal
reclaims
reco
recognisable
recognised
recognises
recognition
recognize
recognized
recognizes
recommend
recommendation
recommendations
recommended
recompile
recompu
recomputation
recompute
recomputed
recomputes
reconcile
reconciled
reconciliation
reconfiguration
reconfigure
reconstr
reconstruct
reconstruction
record
recorded
recording
records
recover
recovers
recovery
rect
rectangular
rectif
rectified
recurrence
recurrent
recurse
recurses
recursion
recursions
recursive
recursively
recv
red
rederive
redesign
redirect
redirects
reduc
reduce
reduced
reducer
reduces
reduction
reductions
redundancy
reevaluate
reexport
ref
refactor
refe
refer
refere
referen
referenc
reference
referenced
references
refine
refinement
refinements
refines
refl
reflect
reflected
reflection
reflects
refresh
refreshed
refs
refuse
refuses
reg
regardless
regen
regenerate
regex
regi
region
regional
regions
regis
regist
register
registered
registers
registr
registratio
registration
registry
regressed
regressio
regression
regs
regular
regularization
regularized
reinit
reinitialize
rejected
rejection
rejections
rejects
rel
relabeling
related
relates
relation
relations
relationship
relative
relaxation
relaxations
relaxes
release
releases
relevant
reliability
reload
relu
remain
remainder
remaining
remains
remap
remapping
remat
rematerialize
remediation
remove
removes
removing
rename
renamed
render
rendered
renderer
renders
rendezvous
reorder
reorderings
rep
repair
repeat
repeated
repeatedly
repeating
repeats
repl
repla
replace
replaced
replacement
replaces
replan
replay
replays
replica
replicate
replicated
replication
repo
report
reported
reporter
reporting
reports
repository
repr
representable
representation
representative
represents
reproduce
reproduced
reproduces
reproducib
reproducibility
reproducible
reps
requ
request
requested
requests
requi
requir
require
required
requirement
requirements
requires
res
resampled
rescale
research
reserve
reset
resets
reshape
reshaped
reshard
resharding
reside
residen
residency
resident
residu
residual
residuals
residue
resilience
resistance
resize
resolution
resolutions
resolve
resolved
resolver
resolves
resolving
resource
resources
resp
respected
respects
responds
respons
response
responsibilities
responsible
rest
restart
restarts
restore
restores
restrict
restricted
restriction
restricts
restruc
resty
restype
restypes
resu
result
results
resume
ret
retain
retained
retention
retraction
retrieval
retrofit
retu
retune
retur
return
returned
returni
returning
returns
reusability
reusable
reuse
reuses
rev
reveal
revers
reverse
reverses
reversible
reversion
reverting
review
reviewed
reviewer
reviewers
revisit
revive
revolution
revolutionary
reward
rewarders
reworked
rewrite
rewriter
rewrites
rewritten
rewrote
rfft
rhs
rich
ridge
rieman
riemann
right
rinen
ring
risc
risk
risks
rlhf
rlvr
rms
rmsnor
rmsnorm
rmul
rng
rngqmc
rnn
roadmap
roadmaps
robin
robust
robustness
roc
rocdl
rocm
rocprofiler
rodrigues
role
roles
roll
rolled
rolling
rollout
rollouts
rollup
roofline
rooflines
root
roots
rope
rota
rotary
rotate
rotated
rotates
rotating
rotation
rotational
rotations
roto
rotor
rotors
rotted
round
rounding
rounds
roundtrip
roundtrips
route
routed
router
routes
routing
row
rowmaj
rowop
rows
rsqrt
rtol
rubin
ruff
rule
rules
run
rung
rungs
runnable
runner
running
runs
runt
runti
runtim
runtime
runway
rust
saf
safe
safely
safetensors
safety
sage
salmon
sam
same
sampl
sample
sampled
sampler
samplers
samples
sampling
san
sandbox
sandboxing
sandw
sandwich
sane
sanitization
sanitizer
sanitizers
sanity
sati
satisfaction
satisfies
satisfy
saturates
saturation
save
saved
saves
saving
say
says
sca
scaffold
scaffolded
scaffolding
scaffolds
scal
scala
scalar
scalarization
scalarize
scalars
scale
scaled
scaler
scales
scaling
scan
scanned
scanner
scanning
scans
scatter
scatters
scenario
scenarios
scf
sched
schedu
schedul
schedule
scheduled
scheduler
schedulers
schedules
scheduling
schema
schemas
scheme
scholar
schulz
schwarz
science
scientific
sciml
scope
scoped
scopes
scoping
scor
scorable
score
scoreboard
scores
scoring
scr
scrape
scratch
script
scripts
scrubbed
sddmm
sdk
sdpa
sdy
sea
seam
search
searchable
searcher
seco
second
secondary
seconds
section
sections
security
see
seed
seedable
seeded
seeding
seeds
seek
seen
sees
seg
segfault
segm
segmen
segment
segmentation
segments
select
selected
selecting
selection
selective
selector
selects
self
sem
sema
semantic
semantics
send
sender
sending
sends
sensitive
sentencepiece
sentinel
sentinels
separate
separated
separately
separates
separation
sept
seq
seqlen
seqs
seque
sequenc
sequence
sequences
sequencing
sequential
sequentially
serial
serialisable
serialisation
serialise
serialiser
serializable
serialization
serialize
serialized
serializes
series
served
server
service
serving
session
sessions
set
setattr
setitem
sets
settable
setter
setting
settings
setup
seven
seventeen
severity
sgd
sgemm
sgpr
sha
shaders
shadow
shallow
shannon
shap
shape
shaped
shapes
shar
shard
sharded
sharding
shards
shardy
share
shared
sharing
sharp
sheet
sheeted
shell
shells
shift
shifted
shifting
shim
shines
ship
shippe
shipped
ships
shmoo
sho
short
shortcut
shortcuts
shorter
shorthands
shot
shou
should
shouldn
show
showing
shows
shrinks
shuffle
shuffled
shutdown
sib
sibling
side
sides
sig
sigabrt
sigil
sigma
sigmoid
sign
signal
signals
signat
signatu
signatur
signature
signatures
signed
signflip
significance
sil
silent
silentl
silently
silico
silicon
silu
sim
simd
simdgroup
similarity
simple
simpler
simplex
simplicity
simplification
simplified
simplifies
simplify
simpson
simulate
simulated
simulates
simulation
sin
sinc
since
sing
singl
single
singleton
singular
sinh
sink
sinkhorn
sinusoidal
sister
sit
site
sites
sits
six
sixth
size
sized
sizes
skeleton
skeletons
sketch
sketches
ski
skill
skills
skinny
skip
skipped
skipping
skips
sku
skv
slab
slate
sli
slice
slices
slidding
slides
sliding
slightly
slo
slot
slots
slow
slower
slurp
small
smaller
smallest
smells
smem
smi
smok
smoke
smokes
smooth
smoothed
smoothing
smoothness
snapsh
snapshot
snapshots
sniff
snippet
snippets
sobol
soft
softly
softmax
softmaxed
softplus
software
solutions
solv
solve
solver
solvers
solving
some
somewhere
son
song
sort
sorted
sorting
sorts
sou
source
sources
south
space
spacelike
spaces
spacing
spacings
span
spans
sparse
sparsity
spatial
spawn
spd
spe
spec
special
specialised
specialization
specialize
specialized
specific
specifically
specification
specifications
specifics
specified
specs
spectral
spectrum
speculative
speed
speedup
speedups
spelling
spellings
sph
sphere
spherical
spike
spin
spine
spir
spirit
spirv
split
splits
splittable
splitting
spmd
spmm
spoofing
spot
spr
spread
spri
sprint
sprints
spuriously
spv
sql
sqrt
square
squared
squares
squeeze
sram
src
sre
ssa
ssl
ssm
sta
stability
stabl
stable
stablehlo
stack
stacked
stacking
stacks
stag
stage
staged
stages
staging
stale
stamp
stamping
stamps
stan
stand
standa
standalone
standard
standards
standing
star
start
started
starter
starting
starts
stash
stat
state
stateful
stateless
statement
statements
states
static
statically
stationary
statistical
stats
status
statuses
stay
stays
std
stdlib
stdout
ste
steady
stealing
stencil
stencils
step
steps
stereo
stereographic
stereotypes
stft
stil
still
stmt
stochastic
stockham
stokes
stop
stopping
stops
stora
storage
store
stored
stores
stories
story
str
strai
straight
strategic
strategies
strategy
stray
stream
streaming
streamline
streamlines
streams
strength
stress
stri
strict
strictest
strictly
stride
strides
string
strings
strip
strips
stru
struct
structur
structural
structurally
structure
structured
structures
stu
stub
stubbed
stubs
studies
study
style
styles
sub
subarch
subclass
subclasses
subcommand
subcommands
subdirectory
subgradient
subgraph
subgraphs
subgroups
subla
submit
submitters
submitting
submodule
subpackage
subprocess
subprojects
subs
subscript
subsequent
subset
subspac
subspace
subst
substantial
substitute
substrate
subtract
subtracted
subtraction
subtree
succe
succeed
succeeded
succeeds
success
successfully
successive
successors
such
sufficient
suffix
suggest
suggested
suggestion
suggestions
suitable
suite
suited
suites
sum
summaries
summarize
summary
summe
summed
summing
sums
super
superbench
superbuild
superior
superseded
supersedes
supplemental
supplied
supplies
supplying
suppo
support
supported
supporting
supports
suppressed
sur
surf
surfa
surfac
surface
surfaced
surfaces
surprise
surrogate
surrounding
surv
surviv
survive
survives
suspicious
svd
svg
swa
swap
swapped
swapping
swaps
sweep
sweeping
sweeps
swi
swiglu
switch
swizzle
swizzled
swizzles
swizzling
sxm
sym
symb
symbol
symbolic
symbolically
symbols
symdim
symmetric
symmetrically
symmetry
sync
synchronisation
synchronise
synchronization
synchronize
synchronous
syntax
synthesis
synthesize
synthesizes
synthetic
sys
syste
system
systems
systolic
tabl
table
tablegen
tables
tabs
tag
tagged
tagging
tags
tail
tails
taints
take
taken
takes
taking
tall
tally
tan
tang
tangent
tangents
tanh
tape
taps
tar
targ
targe
target
targeted
targeting
targets
task
tasks
tau
taxonomy
tcgen
tchebycheff
teacher
team
teaser
technical
technique
techniques
telemetry
tells
temp
tempdir
temperature
temperatures
template
temporal
ten
tenancy
tens
tension
tensor
tensors
tenstorrent
term
terminals
terms
terry
tes
tess
tesse
tesser
tessera
tesserabench
tesseraneighbors
test
testable
tested
testfile
testing
tests
text
textbook
textbooks
textual
tflo
tflops
tha
than
that
the
their
them
theme
themes
then
theorem
there
therefore
thermal
these
they
thi
thin
thing
things
thinking
thinly
third
this
those
thought
thoughts
thr
thre
thread
threadblock
threade
threadgroup
threadgroups
threading
threads
three
threefry
threshold
thresholds
thro
throu
throug
through
throughout
throughput
throughputs
thunder
tid
tie
tied
tier
tiering
tiers
ties
tight
tightening
til
tilde
tile
tilec
tilecfg
tiled
tilelinear
tiles
tiling
tim
time
timed
timeit
timelike
timeline
timeout
timer
timers
times
timestamp
timestamps
timestep
timesteps
timing
tiny
tips
titans
title
tls
tma
tmem
tmp
tod
today
todo
together
toggle
tok
token
tokenize
tokenizer
tokenizers
tokens
tol
tolerance
tolerant
tombstone
too
tool
toolchain
tooling
toolkit
tools
top
topic
topics
topk
topo
topological
topology
topp
torch
total
totals
touch
touched
touches
touching
toward
toy
tpe
tpp
tppc
tprof
tpu
tpumlir
tra
trac
trace
traceable
traced
tracepoints
tracer
traceref
traces
tracing
track
tracked
tracker
tracking
tracks
tractable
trade
traditio
traditional
traffic
trai
trail
trailing
train
trainability
trainable
trained
trainer
training
trait
traits
traj
trajectories
trajectory
tran
tranformer
trans
transaction
transfer
transferred
transfor
transform
transformation
transformations
transforme
transformer
transformers
transforms
transition
transitions
translate
translates
translation
transparent
transparently
transport
transpose
transposed
trave
treasure
treat
treated
treats
tree
treedef
trees
tri
trial
trials
triangle
triangular
tric
tries
trig
trigamma
trigger
triggered
triggers
trim
trims
trip
triple
triples
triplet
trippable
trips
triton
trivial
troubleshooting
true
truediv
truncated
truncates
truncation
trust
trusts
truth
truthfully
truthy
try
tshared
tsol
tspkg
tsr
tss
tukey
tunable
tune
tuned
tuner
tuning
tuple
tuples
turbulent
turn
turned
tuto
tutorial
tutorials
twice
two
txt
type
typed
typedef
types
typic
typical
typing
typos
uint
ula
ulp
unadjusted
unaligned
unannounced
unaries
unary
unavai
unavailable
unbalanced
unbatch
unbatched
unblocks
unbounded
unbridged
unbuffered
uncertainty
unchanged
unchecked
unchunked
uncommitted
unconditional
unconstrained
uncorrelated
uncovered
und
undated
unde
undef
undefined
under
underlying
underscore
understanding
understands
uneven
unflatten
unfreeze
unhashable
unification
unified
unifies
uniform
uniformly
uniforms
unify
unigram
unimplemented
uninitialized
uninspectable
unio
union
unions
unique
uniqueness
unit
units
unity
universal
unk
unknown
unless
unlike
unlowered
unlucky
unmap
unmask
unmasked
unmasking
unmatched
unmeasured
unmerge
unmerged
unofficial
unpack
unparse
unparseable
unpartitioned
unplannable
unqualified
unrecognized
unregistered
unrelated
unresolvable
unrestricted
unrolling
unrolls
unsanitized
unscale
unscaled
unset
unsigned
unsqueeze
unsupported
until
untouched
untracked
untrusted
untyped
unused
unusual
unwind
unwrap
unwraps
unzipping
upcast
upcasts
upcoming
upd
updat
update
updated
updates
upgrade
upgraded
upgrades
uplift
upload
uploaded
uploads
upper
ups
upsert
upstre
upstream
upward
urgent
usability
usable
usage
use
used
usefu
useful
user
users
uses
using
utilisation
utilities
utility
utilization
utils
vague
val
valid
validat
validate
validated
validates
validation
validator
validators
valu
valuable
value
valued
values
vanilla
var
varargs
vari
variable
variables
variance
variant
variants
variation
variational
varies
various
vars
vary
varying
vec
vect
vecto
vector
vectorised
vectorization
vectorize
vectorized
vectorizer
vectors
velocity
venv
verbatim
verbose
verbosity
verdict
veri
verif
verifi
verification
verified
verifier
verifiers
verifies
verify
versi
version
versioned
versioning
versions
versus
vert
vertex
vertical
vertices
very
via
video
view
views
vincent
violate
violated
violates
violation
violations
virtual
visibility
visible
vision
visit
visitor
visits
visual
visualization
visualize
viz
vjp
vjps
vlb
vmap
vmf
vnni
vocab
vocabulary
void
vol
volume
volumes
von
vulnerability
wafer
wai
wait
waits
waituntilcompleted
walk
walked
walker
walkers
walking
walks
walkthrough
wall
want
war
warm
warms
warmup
warn
warning
warnings
warns
warp
